load-test/k6/results/test-4/2-min-ingestion-50-vus/insert-app_csharp_3.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\ 
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 2m0s (gracefulStop: 30s)


     _csharp_3......................: avg=12.291854 min=3.345  med=11.045  max=146.142  p(90)=17.737  p(95)=20.868
     data_received..................: 101 MB 843 kB/s
     data_sent......................: 92 MB  768 kB/s
     http_req_blocked...............: avg=3.26µs    min=1µs    med=2µs     max=17.45ms  p(90)=3µs     p(95)=4µs
     http_req_connecting............: avg=388ns     min=0s     med=0s      max=3.64ms   p(90)=0s      p(95)=0s
     http_req_duration..............: avg=12.37ms   min=3.39ms med=11.12ms max=146.18ms p(90)=17.82ms p(95)=20.96ms
       { expected_response:true }...: avg=12.37ms   min=3.39ms med=11.12ms max=146.18ms p(90)=17.82ms p(95)=20.96ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 477466
     http_req_receiving.............: avg=70.5µs    min=11µs   med=33µs    max=51.84ms  p(90)=65µs    p(95)=189µs
     http_req_sending...............: avg=16.01µs   min=5µs    med=14µs    max=7.62ms   p(90)=21µs    p(95)=25µs
     http_req_tls_handshaking.......: avg=0s        min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=12.29ms   min=3.34ms med=11.04ms max=146.14ms p(90)=17.73ms p(95)=20.86ms
     http_reqs......................: 477466 3978.540217/s
     iteration_duration.............: avg=12.55ms   min=3.53ms med=11.3ms  max=146.4ms  p(90)=18.01ms p(95)=21.15ms
     iterations.....................: 477466 3978.540217/s
     vus............................: 50     min=50        max=50
     vus_max........................: 50     min=50        max=50


running (2m00.0s), 00/50 VUs, 477466 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  2m0s