load-test/k6/results/test-4/2-min-ingestion-50-vus/insert-app_go_http_only.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\ 
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 2m0s (gracefulStop: 30s)


     _go_http_only..................: avg=8.368127 min=1.288  med=7.761  max=173.325  p(90)=11.566  p(95)=13.222
     data_received..................: 128 MB 1.1 MB/s
     data_sent......................: 137 MB 1.1 MB/s
     http_req_blocked...............: avg=3.02µs   min=0s     med=2µs    max=3.87ms   p(90)=3µs     p(95)=4µs
     http_req_connecting............: avg=350ns    min=0s     med=0s     max=1.72ms   p(90)=0s      p(95)=0s
     http_req_duration..............: avg=8.41ms   min=1.32ms med=7.8ms  max=173.36ms p(90)=11.61ms p(95)=13.27ms
       { expected_response:true }...: avg=8.41ms   min=1.32ms med=7.8ms  max=173.36ms p(90)=11.61ms p(95)=13.27ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 697447
     http_req_receiving.............: avg=33.74µs  min=11µs   med=28µs   max=113.36ms p(90)=43µs    p(95)=56µs
     http_req_sending...............: avg=14.78µs  min=5µs    med=12µs   max=9.78ms   p(90)=20µs    p(95)=23µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=8.36ms   min=1.28ms med=7.76ms max=173.32ms p(90)=11.56ms p(95)=13.22ms
     http_reqs......................: 697447 5811.747986/s
     iteration_duration.............: avg=8.59ms   min=1.47ms med=7.98ms max=173.51ms p(90)=11.79ms p(95)=13.45ms
     iterations.....................: 697447 5811.747986/s
     vus............................: 50     min=50        max=50
     vus_max........................: 50     min=50        max=50


running (2m00.0s), 00/50 VUs, 697447 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  2m0s